{"cite":"https://www.exai.com/blog/http-status-codes-cheat-sheet",
"core":{"1":"Informational request","2":"Successful request","3":"Redirect","4":"Client error","5":"Server error"},
"100":{"short":"Informal"},
"200":{"short":"OK","long":"Successful request."},
"201":{"short":"Created","long":"The server acknowledged the created resource."},
"202":{"short":"Accepted","long":"The client's request has been received but the server is still processing it."},
"203":{"short":"Non-Authoritative Information","long":"The response that the server sent to the client is not the same as it was when the server sent it."},
"204":{"short":"No Content","long":"The server processed the request but is not giving any content."},
"205":{"short":"Reset Content","long":"The client should refresh the document sample."},
"206":{"short":"Partial Content","long":"The server is sending only a portion of the resource."},
"207":{"short":"Multi-Status","long":"The message body that follows is by default an XML message and can contain a number of separate response codes."},
"208":{"short":"Already Reported","long":"The members of a WebDAV binding have already been enumerated in a preceding part of the (multistatus) response, and are not being included again."},
"300":{"short":"Multiple Choices","long":"The request the client made has several possible responses."},
"301":{"short":"Moved Permanently","long":"The server tells the client that the resource they look for has been moved permanently to another URL. All users and bots will be redirected to the new URL. It's a very important status code for SEO."},
"302":{"short":"Found","long":"A website or page has been moved to a different URL temporarily. It's another status code relevant to SEO."},
"303":{"short":"See Other","long":"This code tells the client that the server is not redirecting them to the requested resource but to another page."},
"304":{"short":"Not Modified","long":"The requested resource has not been changed since the previous transmission."},
"305":{"short":"Use Proxy","long":"The client can only access the requested resource through a proxy that's given in the response."},
"307":{"short":"Temporary Redirect","long":"The server tells the client that the resource they look for has been redirected temporarily to another URL. It's relevant to SEO performance."},
"308":{"short":"Permanent Redirect","long":"The server tells the client that the resource they look for has been redirected temporarily to another URL."},
"400":{"short":"Bad Request","long":"The client is sending a request with incomplete data, poorly constructed data, or invalid data."},
"401":{"short":"Unauthorized","long":"Authorization is needed for the client to access the requested resource."},
"403":{"short":"Forbidden","long":"The resource the client is trying to access is forbidden."},
"404":{"short":"Not Found","long":"The server is reachable, but the specific page the client is looking for is not. If a website has too many 404 errors, search engines, such as Google and Yahoo, will get a negative impression. The simplest and easiest way to fix a 404 error code is to redirect the page using a 301 redirect."},
"405":{"short":"Method Not Allowed","long":"The server has received and recognized the request, but has rejected the specific request method."},
"406":{"short":"Not Acceptable ","long":"The 406 Not Acceptable status code is an error message that means your website or web application does not support the client's request with a particular protocol"},
"407":{"short":"Proxy Authentication Required","long":"This status code is similar to 401 Unauthorized. The only difference is that authorization needs to be done by a proxy."},
"408":{"short":"Request Timeout","long":"The request the client sent to the website server has expired."},
"409":{"short":"Conflict","long":"The request that it was sent conflicts with the server's internal operations."},
"410":{"short":"Gone","long":"The resource the client wants to access has been permanently erased."},
"402":{"short":"Payment Required"},
"412":{"short":"Precondition Failed"},
"415":{"short":"Unsupported Media Type"},
"416":{"short":"Requested Range Not Satisfiable"},
"417":{"short":"Expectation Failed"},
"422":{"short":"Unprocessable Entity"},
"423":{"short":"Locked"},
"424":{"short":"Failed Dependency"},
"426":{"short":"Upgrade Required"},
"429":{"short":"Too Many Requests"},
"431":{"short":"Request Header Fields Too Large"},
"451":{"short":"Unavailable for Legal Reasons"},
"500":{"short":"Internal Server Error","long":"The server run into a situation it can't handle while processing the client's request."},
"501":{"short":"Not Implemented","long":"The server doesn't know or can resolve the request method sent by the client."},
"502":{"short":"Bad Gateway","long":"The server was acting as a gateway or proxy and received an invalid message from an inbound server."},
"503":{"short":"Service Unavailable","long":"The server might be down and can't process the client's request. This HTTP status code is one of the most common server issues you can come across on the web. It can also negatively affect your SEO. If the 503 error doesn't get resolved soon, search engines will register it as a permanent issue and de-index the page."},
"511":{"short":"Network Authentication Required","long":"The client needs to get authenticated on the network before it can access the resource."},
"504":{"short":"Gateway Timeout"},
"505":{"short":"HTTP Version Not Supported"},
"506":{"short":"Variant Also Negotiates"},
"507":{"short":"Insufficient Storage"},
"508":{"short":"Loop Detected"},
"510":{"short":"Not Extended"}
}
